# Функции len(), range, max(), min() 

#-------------------------------
# len()
name = input('Введите ваше имя: ')
# len() Длина строки
print(len(name))
print('\n')
#-------------------------------

#-------------------------------
# range()

# Range(Stop)
peremen = range(5)
for i in peremen:
	print(i, end = ",")
print('\n')

# Range(Start, Stop)
for i in range(1, 7):
   print(i, end = ", ")

# Range(Start, Stop[, Step])
for i in range(1, 7, 3):
   print(i, end = ", ")
#-------------------------------

#-------------------------------
# max(), min()
my_list = [1,4,5,8,12,2]
# max() Нахождение Максимума
print(max(my_list))
# min() Нахождение Минимума
print(min(my_list))
#-------------------------------

# Методы find, rfind, replace, count, split, join, index, try-except

#-------------------------------
# find() 
# find()  строка в которой будет произведен поиск
print('холод'.find('о', 2, 5)) # в срезе [2:5] 'холод' ищем первое совпадение с 'о' 
print('холод'.find('о')) # в строке 'холод' ищем первое совпадение с 'о'
print('холод'.find('у')) # в строке 'холод' ищем первое совпадение с 'у'

# rfind 
print('холод'.rfind('о', 0, 3)) # в срезе [0:3] 'холод' ищем первое совпадение с 'о' 
print('холод'.rfind('о')) # в строке 'холод' ищем первое совпадение с 'о'
print('холод'.rfind('у')) # в строке 'холод' ищем первое совпадение с 'у'
#-------------------------------

#-------------------------------
# replace()
test = '123don'
print(test)
print(test.replace('123','lon') )
#-------------------------------

#-------------------------------
# count()
cont_lisy = ['sf', 'sf',4,5,6, 'sf', 'sf',]
print('--------------->', cont_lisy.count('sf'))
#-------------------------------

#-------------------------------
# split() 
# split() Разбиение строки по разделителю или листа

text = 'red geen blue'
print(text.split())

#-------------------------------

#-------------------------------
# join
A = ['red', 'green', 'blue']
print(' '.join(A))
print(''.join(A))
print('***'.join(A))
#-------------------------------

#-------------------------------
# index 
listwe = ['ef','sef','q3','sef']
print('--------------->',listwe.index('sef', 3))
#-------------------------------

#-------------------------------
# try-except 
# try-except обработка исключения
while True:
    # Введите целочисленное значение из консоли.
    x = int(input('x: '))
 
    # Разделите 1 на x, чтобы проверить ошибки
    try:
        result = 1 / x
    except:
        print("ошибкa")
        exit(0)
    else:
        print("Пример передачи")
        exit(1) 
#-------------------------------


