# | План работы программы |
# Запрос данных 
# Проверка и анализ данных ...........| def datarequest()
# Определение графы ..................| def graf_1_2_3()
# Список болезней ....................| def infection_and_pain(graf)
# Годен или нет / относительно граф ..| def zluzba_or_not()

# Функция для фичи
def fich():
	print('вывод всех знаков по приколу -!"№;%:?*()_+:;"?|}{')

#Code
import sys	
print('Эта программа определит Вы годны для армии или нет, (при ответах на вопросы учитывайте регистро-зависимость)')
input("Press Enter to Continue...\n") # Так надо 
print('Сейчас мы запросим ваши данные (\n')

# запрос данных
familia = input('Введите вашу фамилию --: ')
fich()
name = input('Введите ваше имя --: ')
fich()
otchestvo = input('Введите ваше отчество --:')
fich()
# обработка исключения
while True:
	try:  
		global age
		age = int(input('Введите ваш возраст --:'))
		fich()
		break
	except ValueError: # функция получает аргумент правильного типа, но некорректного значения
		print('не прокатит')	

# проверка 
def datarequest():
	# test
	fich()
	if (age > 100):
		print('прикольно но не надо')
		sys.exit(0)
	# Пока рано
	if (age < 16):
		print('Такой возраст не подходит')
		sys.exit(0)
	else:
		pass

	if (age < 18):
		print('Ок, идем дальше')
		input("Press Enter to Continue...")
		graf_1_2_3()
	else:
		pass
	# по желанию
	if (age >= 27):
		print('Вы хотите в армию? Можем устроить')
		otvet = input('Да / Нет --:')
		if (otvet == 'Нет'):
			sys.exit(0)
		else:
			pass
		if (otvet == 'Да'):
			print('Мы всегда рады, ДОЛГ! ЧЕСТЬ! РОДИНА!')
			input("Press Enter to Continue...")
			graf_1_2_3()
		else:
			pass
	# 100% идешь в армию
	if (age >= 18 & age < 27):
		print('\nЗдравствуй, небо в облаках, \nЗдравствуй, юность в сапогах! \nПропади, моя тоска, \nВот он я, привет, войска!\n')
		input("Press Enter to Continue...\n")
		graf_1_2_3()
	
	else:
		pass
	
	

# /////////////////////////////////////////////////////////////////////////////////////////////////////// 

# список болезней / относительно статей и вашей графы

def infection_and_pain(graf): 
	fich()
	# Список номеров болезней
	choice = []
	# Список болезней вводимых с клавиатуры
	global yourbolezni
	yourbolezni = []
	# Статьи болезней
	print('# 1. ИНФЕКЦИОННЫЕ И ПАРАЗИТАРНЫЕ БОЛЕЗНИ (ШИФР ПО МКБ – 10 A00 – B99)')
	print('# 2. НОВООБРАЗОВАНИЯ (ШИФР ПО МКБ – 10 C00 – D48)')
	print('# 3. БОЛЕЗНИ КРОВИ, КРОВЕТВОРНЫХ ОРГАНОВ И ОТДЕЛЬНЫЕ НАРУШЕНИЯ, ВОВЛЕКАЮЩИЕ ИММУННЫЙ МЕХАНИЗМ (ШИФР ПО МКБ – 10 D50 – D89)')
	print('# 4. БОЛЕЗНИ ЭНДОКРИННОЙ СИСТЕМЫ, РАССТРОЙСТВА ПИТАНИЯ И НАРУШЕНИЯ ОБМЕНА ВЕЩЕСТВ (ШИФР ПО МКБ – 10 E00 – E90)')
	print('# 5. ПСИХИЧЕСКИЕ И ПОВЕДЕНЧЕСКИЕ РАССТРОЙСТВА (ШИФР ПО МКБ – 10 F00 – F99)')
	print('# 6. БОЛЕЗНИ НЕРВНОЙ СИСТЕМЫ (ШИФР ПО МКБ – 10 G00 – G99)')
	print('# 7. БОЛЕЗНИ ГЛАЗА И ПРИДАТОЧНОГО АППАРАТА (ШИФР ПО МКБ – 10 H00 – H59)')
	print('# 8. БОЛЕЗНИ УХА И СОСЦЕВИДНОГО ОТРОСТКА (ШИФР ПО МКБ – 10 H60 – H95)')
	print('# 9. БОЛЕЗНИ СИСТЕМЫ КРОВООБРАЩЕНИЯ (ШИФР ПО МКБ – 10 I00 – I99)')
	
	# пока в разработке
	''' print('# 10. БОЛЕЗНИ ОРГАНОВ ДЫХАНИЯ (ШИФР ПО МКБ – 10 J00 – J99)')
	print('# 11. БОЛЕЗНИ ОРГАНОВ ПИЩЕВАРЕНИЯ (ШИФР ПО МКБ – 10 K00 – K93)')
	print('# 12. БОЛЕЗНИ КОЖИ И ПОДКОЖНОЙ КЛЕТЧАТКИ (ШИФР ПО МКБ – 10 L00 – L99)')
	print('# 13. БОЛЕЗНИ КОСТНО-МЫШЕЧНОЙ СИСТЕМЫ И СОЕДИНИТЕЛЬНОЙ ТКАНИ (ШИФР ПО МКБ – 10 M00 – M99)')
	print('# 14. БОЛЕЗНИ МОЧЕПОЛОВОЙ СИСТЕМЫ (ШИФР ПО МКБ – 10 N00 – N99)')
	print('# 15. БЕРЕМЕННОСТЬ, РОДЫ И ПОСЛЕРОДОВОЙ ПЕРИОД (ШИФР ПО МКБ – 10 O00 – O99)')
	print('# 16. ВРОЖДЕННЫЕ АНОМАЛИИ (ПОРОКИ РАЗВИТИЯ), ДЕФОРМАЦИИ И ХРОМОСОМНЫЕ НАРУШЕНИЯ (ШИФР ПО МКБ – 10 Q00 – Q99)')
	print('# 17. ПОСЛЕДСТВИЯ ТРАВМ, ОТРАВЛЕНИЙ И ДРУГИХ ВОЗДЕЙСТВИЙ ВНЕШНИХ ФАКТОРОВ (ШИФР ПО МКБ – 10 S00 – T98)')
	print('# 18. ПРОЧИЕ БОЛЕЗНИ (ШИФР ПО МКБ – 10 R00 – R99)\n') '''
	
	# Сумма выбранных ваших болезней
	print('Определите сколько всего элементов вы введете\n')
	colvoelemenyov = int(input('Колво элементов списка, --:'))
	for i in range(colvoelemenyov):
		#Выбор статей болезней
		element = int(input('Выбирите ваши проблемные места 1/2/3 и т.д --:'))
		choice.append(element)
		continue
	
	# Болезни
	if (True):
		
		# Статья 1
		if (1 in choice):
			print('\nТут всего пунктов 1.1-1.7')
			print('Это статья -- # 1. ИНФЕКЦИОННЫЕ И ПАРАЗИТАРНЫЕ БОЛЕЗНИ (ШИФР ПО МКБ – 10 A00 – B99) ')
			
			# 1.1
			print('''\nПункт: 1.1
			---------------------------------------> 
			Кишечные_инфекции, бактериальные_
			зоонозы, другие бактериальные_болезни,
			вирусные_болезни, сопровождающиеся
			высыпаниями, вирусные и другие болезни,
			передаваемые членистоногими (кроме
			инфекций_центральной_нервной_системы),
			другие болезни, вызываемые вирусами
			и хламидиями, риккетсиозы, другие
			инфекционные и паразитарные болезни:
			---------------------------------------> ''')
			colvobolezney = int(input('Сколько болезней из спика у вас есть? --:'))
			for i in range(colvobolezney):
				# Выбор болезней 
				vvod_bolezni = input('Введите ваши болезни с нижним подчеркиванием --:')
				yourbolezni.append(vvod_bolezni)
				continue
			# Болезни в трудном или легком виде
			global trud_legk_bolezni 
			if (colvobolezney == 0):
				trud_legk_bolezni = "_"
			else:
				trud_legk_bolezni = "_"
				
			if (colvobolezney > 0):
				trud_legk_bolezni = input('Введите "+" если у вас осложнения, если нет то "-" /:')
			else:
				pass
			if (colvobolezney < 0):
				print('Так нельзя вводить')
			else:
				pass

			# 1.2
			print('''Пункт: 1.2 \n
			------------------------->
			Туберкулез органов дыхания
			а1) активный с выделением микобактерий туберкулеза и (или) наличием распада; прогрессирующий
			б1) активный без выделения микобактерий туберкулеза и без наличия распада
			в1) клинически излеченный
			г1) малые остаточные изменения после излеченного туберкулеза
			д1) временные функциональные расстройства после лечения
			------------------------->''')
			colvobolezney = int(input('Сколько болезней из спика у вас есть? --:'))
			for i in range(colvobolezney):
				# Выбор болезней 
				vvod_bolezni = input('Введите соотбетственную букву вашей болезни --:')
				yourbolezni.append(vvod_bolezni)
				continue
		
			# 1.3
			print('''Пункт: 1.3 \n
			------------------------->
			Туберкулез других органов и систем:
			а2) активный прогрессирующий 
			б2) активный в период основного курса лечения
			в2) клинически излеченный 
			г2) остаточные изменения, при отсутствии признаков активности свыше 5 лет
			д2) временные функциональные расстройства после лечения
			------------------------->''')
			colvobolezney = int(input('Сколько болезней из спика у вас есть? --:'))
			for i in range(colvobolezney):
				# Выбор болезней 
				vvod_bolezni = input('Введите соотбетственную букву вашей болезни --:')
				yourbolezni.append(vvod_bolezni)
				continue

			# 1.4
			print('''Пункт: 1.4 \n
			------------------------->
			Лепра:
			------------------------->''')
			colvobolezney = 1
			for i in range(colvobolezney):
				# Выбор болезней 
				vvod_bolezni = input('Введите болезнь если такая имеется --:')
				yourbolezni.append(vvod_bolezni)
				continue
			
			# 1.5
			print('''Пункт: 1.5 \n
			------------------------->
			Болезнь, вызываемая вирусом иммунодефицита человека (далее – ВИЧ):
			а3) пациенты с ВИЧинфекцией в стадии вторичных заболеваний (стадии 2В, 4А – 4В, 5)
			б3) пациенты с ВИЧинфекцией в стадии первичных проявлений (стадии 1, 2А, 2Б, 3)
			------------------------->''')
			colvobolezney = int(input('Сколько болезней из спика у вас есть? --:'))
			for i in range(colvobolezney):
				# Выбор болезней 
				vvod_bolezni = input('Введите соотбетственную букву вашей болезни --:')
				yourbolezni.append(vvod_bolezni)
				continue

			# 1.6
			print('''Пункт: 1.6 \n
			------------------------->
			Сифилис и другие инфекции, передающиеся преимущественно половым путем:
			а4) поздний, врожденный сифилис
			б4) первичный, вторичный и скрытый сифилис при замедленной негативации классических серологических реакций
			в4) первичный, вторичный, скрытый сифилис, гонококковая и другие инфекции, передающиеся преимущественно половым путем\n(мягкий шанкр, паховая лимфогранулема, паховая гранулема, негонококковые уретриты)
			------------------------->''')
			colvobolezney = int(input('Сколько болезней из спика у вас есть? --:'))
			for i in range(colvobolezney):
				# Выбор болезней 
				vvod_bolezni = input('Введите соотбетственную букву вашей болезни --:')
				yourbolezni.append(vvod_bolezni)
				continue

			# 1.7
			print('''Пункт: 1.7 \n
			------------------------->
			Микозы:
			а5) актиномикоз, кандидоз внутренних органов, кокцидиоидоз, гистоплазмоз, бластомикоз, споротрихоз, хромомикоз, феомикотический абсцесс, мицетома
			б5) дерматофитии 
			------------------------->''')
			colvobolezney = int(input('Сколько болезней из спика у вас есть? --:'))
			for i in range(colvobolezney):
				# Выбор болезней 
				vvod_bolezni = input('Введите соотбетственную букву вашей болезни --:')
				yourbolezni.append(vvod_bolezni)
				continue

		# Статья 2
		if (2 in choice):
			print('Это статья -- # 2. НОВООБРАЗОВАНИЯ (ШИФР ПО МКБ – 10 C00 – D48) ')
			# 2.1
			print('''Пункт: 2.1 \n
			------------------------->
			Злокачественные новообразования (кроме опухолей нервной системы, лимфоидной, кроветворной и родственных им тканей):
			а6) при невозможности радикального удаления и наличии отдаленных метастазов
			б6) состояния после радикального удаления первоначальной опухоли, в том числе без регионарных метастазов
			------------------------->''')
			colvobolezney = int(input('Сколько болезней из спика у вас есть? --:'))
			for i in range(colvobolezney):
				# Выбор болезней 
				vvod_bolezni = input('Введите соотбетственную букву вашей болезни --:')
				yourbolezni.append(vvod_bolezni)
				continue
			# 2.2
			print('''Пункт: 2.2 \n
			------------------------->
			Злокачественные новообразования лимфоидной, кроветворной и родственных им тканей \n(лейкозы, болезнь Ходжкина, неходжкинские лимфомы, злокачественные иммунопролиферативные болезни, множественная миелома\n и злокачественные плазмоклеточные новообразования):
			а7) быстро прогрессирующие, а также медленно прогрессирующие со значительными изменениями в составе крови и периодическими обострениями
			б7) медленнопрогрессирующиес умеренным илинезначительнымнарушением функций кроветворной системы и редкими обострениями
			в7) состояние после завершения лучевой или цитостатической терапии
			------------------------->''')
			colvobolezney = int(input('Сколько болезней из спика у вас есть? --:'))
			for i in range(colvobolezney):
				# Выбор болезней 
				vvod_bolezni = input('Введите соотбетственную букву вашей болезни --:')
				yourbolezni.append(vvod_bolezni)
				continue

			# 2.3
			print('''Пункт: 2.3 \n
			------------------------->
			Доброкачественные новообразования (кроме опухолей нервной системы):
			а8) со значительным нарушением функций
			б8) с умеренным нарушением функций
			в8) с незначительным нарушением функций
			г8) при наличии объективных данных без нарушения функций
			д8) временные функциональные расстройства после хирургического лечения
			------------------------->''')
			colvobolezney = int(input('Сколько болезней из спика у вас есть? --:'))
			for i in range(colvobolezney):
				# Выбор болезней 
				vvod_bolezni = input('Введите соотбетственную букву вашей болезни --:')
				yourbolezni.append(vvod_bolezni)
				continue

		# Статья 3
		if (3 in choice):
			print('# 3. БОЛЕЗНИ КРОВИ, КРОВЕТВОРНЫХ ОРГАНОВ И ОТДЕЛЬНЫЕ НАРУШЕНИЯ, ВОВЛЕКАЮЩИЕ ИММУННЫЙ МЕХАНИЗМ (ШИФР ПО МКБ – 10 D50 – D89)')
			# 3.1
			print('''Пункт: 3.1 \n
			------------------------->
			Болезни крови и кроветворных органов, иммунодефицитные состояния:
			а9) быстро прогрессирующие со значительным нарушением функций
			б9) медленно прогрессирующие со значительными изменениями состава крови и периодическими обострениями 
			в9) медленно прогрессирующие с умеренным или незначительным нарушением функций кроветворной системы и редкими обострениями
			г9) временные функциональные расстройства после несистемных болезней крови
			------------------------->''')
			colvobolezney = int(input('Сколько болезней из спика у вас есть? --:'))
			for i in range(colvobolezney):
				# Выбор болезней 
				vvod_bolezni = input('Введите соотбетственную букву вашей болезни --:')
				yourbolezni.append(vvod_bolezni)
				continue
		
		# Статья 4
		if (4 in choice):
			print('# 4. БОЛЕЗНИ ЭНДОКРИННОЙ СИСТЕМЫ, РАССТРОЙСТВА ПИТАНИЯ И НАРУШЕНИЯ ОБМЕНА ВЕЩЕСТВ (ШИФР ПО МКБ – 10 E00 – E90)')
			# 4.1
			print('''Пункт: 4.1 \n
			------------------------->
			Зоб без нарушения функций щитовидной железы:
			а10) вызывающий нарушение функций близлежащих органов
			б10) затрудняющий ношение военной формы одежды
			в10) не затрудняющий ношение военной формы одежды
			------------------------->''')
			colvobolezney = int(input('Сколько болезней из спика у вас есть? --:'))
			for i in range(colvobolezney):
				# Выбор болезней 
				vvod_bolezni = input('Введите соотбетственную букву вашей болезни --:')
				yourbolezni.append(vvod_bolezni)
				continue

			# 4.2
			print('''Пункт: 4.2 \n
			------------------------->
			Другие болезни эндокринной системы, расстройства питания и нарушение обмена веществ:
			а11) со значительным нарушением функций
			б11) с умеренным нарушением функций; ожирение III степени
			в11) с незначительным нарушением функций, ожирение II степени с индексом массы тела (далее – ИМТ) 37,0 кг/м2 и более
			г11) состояние после острого заболевания, обострения хронического заболевания или после оперативного лечения \nпри наличии временных функциональных расстройств
			д11) недостаточная масса тела (с ИМТ от 16,9 кг/м2 до 18,0 кг/м2 ); ожирение I степени, \nожирение II степени с ИМТ до 37,0 кг/м2, субклинический гипотиреоз
			------------------------->''')
			colvobolezney = int(input('Сколько болезней из спика у вас есть? --:'))
			for i in range(colvobolezney):
				# Выбор болезней 
				vvod_bolezni = input('Введите соотбетственную букву вашей болезни --:')
				yourbolezni.append(vvod_bolezni)
				continue

		# Статья 5
		if (5 in choice):
			print('# 5. ПСИХИЧЕСКИЕ И ПОВЕДЕНЧЕСКИЕ РАССТРОЙСТВА (ШИФР ПО МКБ – 10 F00 – F99) ')
			# 5.1
			print('''Пункт: 5.1 \n
			------------------------->
			Органические, в том числе и симптоматические, психические расстройства:
			а12) выраженные нарушения функционирования
			б12) умеренные нарушения функционирования
			в12) легкие нарушения функционирования
			г12) при стойкой компенсации перенесенных легких психических расстройств либо психические расстройства, закончившиеся выздоровлением
			------------------------->''')
			colvobolezney = int(input('Сколько болезней из спика у вас есть? --:'))
			for i in range(colvobolezney):
				# Выбор болезней 
				vvod_bolezni = input('Введите соотбетственную букву вашей болезни --:')
				yourbolezni.append(vvod_bolezni)
				continue
			
			# 5.2
			print('''Пункт: 5.2 \n
			------------------------->
			Аффективные расстройства (настроения):
			а13) выраженные 
			б13) умеренные
			в13) легкие 
			------------------------->''')
			colvobolezney = int(input('Сколько болезней из спика у вас есть? --:'))
			for i in range(colvobolezney):
				# Выбор болезней 
				vvod_bolezni = input('Введите соотбетственную букву вашей болезни --:')
				yourbolezni.append(vvod_bolezni)
				continue
			
			# 5.3
			print('''Пункт: 5.3 \n
			------------------------->
			Психические и поведенческие расстройствавследствие употребления психоактивных веществ: 
			а14) при выраженных нарушениях функционирования
			б14) при умеренныхнарушениях функционирования
			в14) при незначительных нарушениях функционирования
			------------------------->''')
			colvobolezney = int(input('Сколько болезней из спика у вас есть? --:'))
			for i in range(colvobolezney):
				# Выбор болезней 
				vvod_bolezni = input('Введите соотбетственную букву вашей болезни --:')
				yourbolezni.append(vvod_bolezni)
				continue

			# 5.4
			print('''Пункт: 5.4 \n
			------------------------->
			Психические расстройства эндогенной этиологии:
			а15) шизофрения, шизотипические расстройства, хронические бредовые расстройства
			б15) острые и транзиторные психотические расстройства 
			------------------------->''')
			colvobolezney = int(input('Сколько болезней из спика у вас есть? --:'))
			for i in range(colvobolezney):
				# Выбор болезней 
				vvod_bolezni = input('Введите соотбетственную букву вашей болезни --:')
				yourbolezni.append(vvod_bolezni)
				continue
			
			# 5.5
			print('''Пункт: 5.5 \n
			------------------------->
			Невротические расстройства, связанные со стрессом, и соматоформные расстройства:
			а16) при резко выраженных нарушениях
			б16) при умеренно выраженных нарушениях, повторных случаях
			в16) состояния, закончившиеся компенсацией
			г16) кратковременные состояния, закончившиеся выздоровлением
			------------------------->''')
			colvobolezney = int(input('Сколько болезней из спика у вас есть? --:'))
			for i in range(colvobolezney):
				# Выбор болезней 
				vvod_bolezni = input('Введите соотбетственную букву вашей болезни --:')
				yourbolezni.append(vvod_bolezni)
				continue

			# 5.6
			print('''Пункт: 5.6 \n
			------------------------->
			Расстройства личности:
			а17) с выраженными нарушениями
			б17) с умеренными нарушениями
			в17) расстройства поведения и эмоций 
			------------------------->''')
			colvobolezney = int(input('Сколько болезней из спика у вас есть? --:'))
			for i in range(colvobolezney):
				# Выбор болезней 
				vvod_bolezni = input('Введите соотбетственную букву вашей болезни --:')
				yourbolezni.append(vvod_bolezni)
				continue

			# 5.7
			print('''Пункт: 5.7 \n
			------------------------->
			Умственная отсталость:
			а18) в глубокой, тяжелой и умеренной степени выраженности
			б18) в легкой степени выраженности
			------------------------->''')
			colvobolezney = int(input('Сколько болезней из спика у вас есть? --:'))
			for i in range(colvobolezney):
				# Выбор болезней 
				vvod_bolezni = input('Введите соотбетственную букву вашей болезни --:')
				yourbolezni.append(vvod_bolezni)
				continue	

		# Статья 6
		if (6 in choice):
			print('# 6. БОЛЕЗНИ НЕРВНОЙ СИСТЕМЫ (ШИФР ПО МКБ – 10 G00 – G99) ')
			# 6.1
			print('''Пункт: 6.1 \n
			------------------------->
			Эпилепсия: 
			а19) при наличии частых эпилептических припадков и (или) выраженных психических нарушений
			б19) при единичных и редких (судорожных и бессудорожных) эпилептических припадках без психических нарушений вне припадка
			------------------------->''')
			colvobolezney = int(input('Сколько болезней из спика у вас есть? --:'))
			for i in range(colvobolezney):
				# Выбор болезней 
				vvod_bolezni = input('Введите соотбетственную букву вашей болезни --:')
				yourbolezni.append(vvod_bolezni)
				continue

			# 6.2
			print('''Пункт: 6.2 \n
			------------------------->
			Воспалительные, демиелинизирующие болезни центральной нервной системы и их последствия:
			а20) со значительным нарушением функций или быстро прогрессирующим течением
			б20) с умеренным нарушением функций
			в20) с незначительным нарушением функций
			г20) при наличии объективных данных без нарушения функций
			------------------------->''')
			colvobolezney = int(input('Сколько болезней из спика у вас есть? --:'))
			for i in range(colvobolezney):
				# Выбор болезней 
				vvod_bolezni = input('Введите соотбетственную букву вашей болезни --:')
				yourbolezni.append(vvod_bolezni)
				continue

			# 6.3
			print('''Пункт: 6.3 \n
			------------------------->
			Органические, наследственнодегенеративные болезни центральной нервной системы и нервно-мышечные заболевания:
			а21) со значительным нарушением функций или быстро прогрессирующим течением
			б21) с умеренным нарушением функций или медленно прогрессирующим течением
			в21) с незначительным нарушением функций
			г21) при наличии объективных данных без нарушения функций
			------------------------->''')
			colvobolezney = int(input('Сколько болезней из спика у вас есть? --:'))
			for i in range(colvobolezney):
				# Выбор болезней 
				vvod_bolezni = input('Введите соотбетственную букву вашей болезни --:')
				yourbolezni.append(vvod_bolezni)
				continue

			# 6.4
			print('''Пункт: 6.4 \n
			------------------------->
			Сосудистые заболевания головного, спинного мозга:
			а22) со значительным нарушением функций
			б22) с умеренным нарушением функций; частые преходящие нарушения мозгового кровообращения
			в22) с незначительным нарушением функций;\n редкие преходящие нарушения мозгового кровообращения;\n при наличии частых синкопальных состояний (обмороков) без признаков органического поражения центральной нервной системы
			г22) при наличии редких синкопальных состояний (обмороков) без признаков органического поражения центральной нервной системы
			------------------------->''')
			colvobolezney = int(input('Сколько болезней из спика у вас есть? --:'))
			for i in range(colvobolezney):
				# Выбор болезней 
				vvod_bolezni = input('Введите соотбетственную букву вашей болезни --:')
				yourbolezni.append(vvod_bolezni)
				continue

			# 6.5
			print('''Пункт: 6.5 \n
			------------------------->
			Травмы головного, спинного мозга и их последствия. Последствия поражений центральной нервной системы от воздействия внешних факторов:
			а23) со значительным нарушением функций
			б23) с умеренным нарушением функций 
			в23) с незначительным нарушением функций
			г23) при наличии объективных данных без нарушения функций
			------------------------->''')
			colvobolezney = int(input('Сколько болезней из спика у вас есть? --:'))
			for i in range(colvobolezney):
				# Выбор болезней 
				vvod_bolezni = input('Введите соотбетственную букву вашей болезни --:')
				yourbolezni.append(vvod_bolezni)
				continue

			# 6.6
			print('''Пункт: 6.6 \n
			------------------------->
			Болезни периферической нервной системы:
			а25) со значительным нарушением функций
			б25) с умеренным нарушением функций
			в25) с незначительным нарушением функций
			г25) при наличии объективных данных без нарушения функций
			------------------------->''')
			colvobolezney = int(input('Сколько болезней из спика у вас есть? --:'))
			for i in range(colvobolezney):
				# Выбор болезней 
				vvod_bolezni = input('Введите соотбетственную букву вашей болезни --:')
				yourbolezni.append(vvod_bolezni)
				continue


			# 6.7
			print('''Пункт: 6.7 \n
			------------------------->
			Травмы периферических нервов и их последствия:
			а26) со значительным нарушением функций
			б26) с умеренным нарушением функций
			в26) с незначительным нарушением функций
			г26) при наличии объективных данных без нарушения функций
			------------------------->''')
			colvobolezney = int(input('Сколько болезней из спика у вас есть? --:'))
			for i in range(colvobolezney):
				# Выбор болезней 
				vvod_bolezni = input('Введите соотбетственную букву вашей болезни --:')
				yourbolezni.append(vvod_bolezni)
				continue
			
			# 6.8
			print('''Пункт: 6.8 \n
			------------------------->
			Временные_функциональные_расстройства_центральной_или_периферической_нервной_системы_после_острого_заболевания,_обострения_хронического_заболевания,_травмы_или_оперативного_лечения;
			------------------------->''')
			colvobolezney = int(input('Сколько болезней из спика у вас есть? --:'))
			for i in range(colvobolezney):
				# Выбор болезней 
				vvod_bolezni = input('Введите соотбетственную букву вашей болезни --:')
				yourbolezni.append(vvod_bolezni)
				continue

		# Статья 7
		if (7 in choice):
			print('# 7. БОЛЕЗНИ ГЛАЗА И ПРИДАТОЧНОГО АППАРАТА (ШИФР ПО МКБ – 10 H00 – H59)')
			# 7.1
			print('''Пункт: 7.1 \n
			------------------------->
			Болезни век, слезных путей, глазницы, конъюнктивы:
			а27) выраженные анатомические изменения или недостатки положения век, глазницы или конъюнктивы со значительным нарушением зрительных\n или двигательных функций на обоих глазах
			б27) то же на одном глазу или умеренно выраженные на обоих глазах; резко выраженные заболевания век, 
			слезных путей, глазницы, конъюнктивы на одном или обоих глазах
			в27) незначительно выраженные анатомические изменения или недостатки положения век, глазницы или конъюнктивы;\n умеренно или незначительно выраженные заболевания век, слезных путей, глазницы, конъюнктивы на одном или обоих глазах
			------------------------->''')
			colvobolezney = int(input('Сколько болезней из спика у вас есть? --:'))
			for i in range(colvobolezney):
				# Выбор болезней 
				vvod_bolezni = input('Введите соотбетственную букву вашей болезни --:')
				yourbolezni.append(vvod_bolezni)
				continue

			# 7.2
			print('''Пункт: 7.2 \n
			------------------------->
			Болезни склеры, роговицы, радужной оболочки, цилиарного тела, хрусталика, сосудистой оболочки, сетчатки, стекловидного тела, глазного яблока, зрительного нерва:
			а28) резко выраженные с прогрессирующим снижением зрительных функций или частыми обострениями на обоих глазах
			б28) то же на одном глазу или умеренно выраженные на обоих глазах
			в28) умеренно выраженные, непрогрессирующие с редкими обострениями на одном глазу
			------------------------->''')
			colvobolezney = int(input('Сколько болезней из спика у вас есть? --:'))
			for i in range(colvobolezney):
				# Выбор болезней 
				vvod_bolezni = input('Введите соотбетственную букву вашей болезни --:')
				yourbolezni.append(vvod_bolezni)
				continue

			# 7.3
			print('''Пункт: 7.3 \n
			------------------------->
			Отслойка и разрывы сетчатки: 
			а29) нетравматической этиологии на обоих глазах
			б29) посттравматической этиологии на обоих глазах
			в29) любой этиологии на одном глазу
			------------------------->''')
			colvobolezney = int(input('Сколько болезней из спика у вас есть? --:'))
			for i in range(colvobolezney):
				# Выбор болезней 
				vvod_bolezni = input('Введите соотбетственную букву вашей болезни --:')
				yourbolezni.append(vvod_bolezni)
				continue	
			
			# 7.4
			print('''Пункт: 7.4 \n
			------------------------->
			Глаукома:
			а30) в развитой и последующих стадиях на обоих глазах
			б30) то же на одном глазу
			в30) в начальной стадии, в стадии преглаукомы одного или обоих глаз
			------------------------->''')
			colvobolezney = int(input('Сколько болезней из спика у вас есть? --:'))
			for i in range(colvobolezney):
				# Выбор болезней 
				vvod_bolezni = input('Введите соотбетственную букву вашей болезни --:')
				yourbolezni.append(vvod_bolezni)
				continue	
			
			# 7.5
			print('''Пункт: 7.5 \n
			------------------------->
			Болезни мышц глаза, нарушения содружественного движения глаз
			а31) стойкий паралич двигательных мышц глазного яблока при наличии диплопии
			б31) то же при отсутствии диплопии; содружественное косоглазие при 
			отсутствии бинокулярного зрения
			------------------------->''')
			colvobolezney = int(input('Сколько болезней из спика у вас есть? --:'))
			for i in range(colvobolezney):
				# Выбор болезней 
				vvod_bolezni = input('Введите соотбетственную букву вашей болезни --:')
				yourbolezni.append(vvod_bolezni)
				continue	

			# 7.6
			print('''Пункт: 7.6 \n
			------------------------->
			Нарушения рефракции и аккомодации:
			а32) близорукость или дальнозоркость любого глаза в одно миз меридианов более 12,0 дптр\nлибо астигматизм любого вида на любом глазу с разницей рефракции в двух главных меридианах более 6,0 дптр
			б32) близорукость или дальнозоркость любого глаза в одном из меридианов более 8,0 дптр \nи до 12,0 дптр либо астигматизм любого вида на любом глазу с разницей рефракции в двух главных меридианах \nболее 4,0 дптр и до 6,0 дптр
			в32) близорукость любого глаза на одном из меридианов более 6,0 дптр и до 8,0 дптр
			г32) близорукость любого глаза на одном из меридианов более 3,0 дптр и до 6,0 дптр,\n дальнозоркость любого глаза на одном из меридианов более \n6,0 дптр и до 8,0 дптр либо астигматизм любого вида на любом глазу\nс разницей рефракции в двух главных меридианах более 2,0 дптр и до 4,0 дптр
			------------------------->''')
			colvobolezney = int(input('Сколько болезней из спика у вас есть? --:'))
			for i in range(colvobolezney):
				# Выбор болезней 
				vvod_bolezni = input('Введите соотбетственную букву вашей болезни --:')
				yourbolezni.append(vvod_bolezni)
				continue	

			# 7.7
			print('''Пункт: 7.7 \n
			------------------------->
			Слепота, пониженное зрение, аномалии цветового зрения:
			а33) острота зрения одного глаза 0,09 и ниже или его слепота при остроте зрения другого глаза 0,3 и ниже,\n а также отсутствие глазного яблока при остроте зрения другого глаза 0,3\n и ниже или острота зрения обоих глаз 0,2 и ниже
			б33) острота зрения одного глаза 0,09 и ниже или его слепота при остроте\n зрения другого глаза 0,4 и выше, а также отсутствие глазного яблока при остроте зрения другого глаза \n0,4 и выше или острота зрения одного глаза 0,3 при остроте зрения другого глаза от 0,3 до 0,1
			в33) острота зрения одного глаза 0,4 при остроте зрения другого глаза от 0,3 до 0,1
			г33) дихромазия, цветослабость II – III степени
			------------------------->''')
			colvobolezney = int(input('Сколько болезней из спика у вас есть? --:'))
			for i in range(colvobolezney):
				# Выбор болезней 
				vvod_bolezni = input('Введите соотбетственную букву вашей болезни --:')
				yourbolezni.append(vvod_bolezni)
				continue
			
			# 7.8
			print('''Пункт: 7.8 \n
			------------------------->
			Временные_функциональные_расстройства_органа_зрения_после_острого_заболевания, 
			обострения_хронического_заболевания,
			травмы_или_хирургического_лечения
			------------------------->''')
			colvobolezney = int(input('Сколько болезней из спика у вас есть? --:'))
			for i in range(colvobolezney):
				# Выбор болезней 
				vvod_bolezni = input('Введите соотбетственную букву вашей болезни --:')
				yourbolezni.append(vvod_bolezni)
				continue

		# Статья 8
		if (8 in choice):
			print('# 8. БОЛЕЗНИ УХА И СОСЦЕВИДНОГО ОТРОСТКА (ШИФР ПО МКБ – 10 H60 – H95)')
			# 8.1
			print('''Пункт: 8.1 \n
			------------------------->
			Болезни наружного уха: 
			экзема_наружного_слухового_прохода_и_ушной_раковины,
			хронический_диффузный_наружный_отит_любой_этиологии, 
			приобретенные_сужения_наружного_слухового_прохода;
			------------------------->''')
			colvobolezney = int(input('Сколько болезней из спика у вас есть? --:'))
			for i in range(colvobolezney):
				# Выбор болезней 
				vvod_bolezni = input('Введите соотбетственную букву вашей болезни --:')
				yourbolezni.append(vvod_bolezni)
				continue
			
			# 8.2
			print('''Пункт: 8.2 \n
			------------------------->
			Болезни среднего уха и сосцевидного отростка:
			а34) двусторонний или односторонний хронический средний отит, сопровождающийся полипами,\n грануляциями в барабанной полости, кариесом кости
			б34) стойкие остаточные явления перенесенного хронического среднего отита; резкое стойкое расстройство барофункции уха
			------------------------->''')
			colvobolezney = int(input('Сколько болезней из спика у вас есть? --:'))
			for i in range(colvobolezney):
				# Выбор болезней 
				vvod_bolezni = input('Введите соотбетственную букву вашей болезни --:')
				yourbolezni.append(vvod_bolezni)
				continue
			
			# 8.3
			print('''Пункт: 8.3 \n
			------------------------->
			Нарушения вестибулярной функции: 
			а35) стойкие значительно выраженные вестибулярные расстройства, болезнь Меньера
			б35) нестойкие редко рецидивирующие, умеренно выраженные вестибулярновегетативные расстройства
			в35) стойкая и резко выраженная чувствительность к вестибулярным раздражениям 
			------------------------->''')
			colvobolezney = int(input('Сколько болезней из спика у вас есть? --:'))
			for i in range(colvobolezney):
				# Выбор болезней 
				vvod_bolezni = input('Введите соотбетственную букву вашей болезни --:')
				yourbolezni.append(vvod_bolezni)
				continue

			# 8.4
			print('''Пункт: 8.4 \n
			------------------------->
			Глухота, недоразвитие речи (I, II, III уровень) речевого развития, понижение слуха:
			а36) глухота на оба уха или недоразвитие речи (I, II, III уровень) речевого развития
			б36) стойкая полная глухота на одно ухо, а также стойкое понижение слуха на оба уха до восприятия шепотной речи менее 1 м
			в36) стойкое понижение слуха на оба уха до степени восприятия шепотной речи от 1 до 2 м,\n а также стойкое понижение слуха при отсутствии восприятия шепотной речи на одно ухо\n и при восприятии шепотной речи на расстоянии до 3 м на другое ухо
			г36) стойкое понижение слуха на оба уха до степени восприятия шепотной речи не менее 2 м на одно ухо и не менее 4 м на другое или 3 м на оба уха
			------------------------->''')
			colvobolezney = int(input('Сколько болезней из спика у вас есть? --:'))
			for i in range(colvobolezney):
				# Выбор болезней 
				vvod_bolezni = input('Введите соотбетственную букву вашей болезни --:')
				yourbolezni.append(vvod_bolezni)
				continue

			# 8.5
			print('''Пункт: 8.5 \n
			------------------------->
			Временные функциональные расстройства после острого заболевания: 
			обострения_хронического_заболевания, 
			травмы_уха_и_сосцевидного_отростка_или_оперативного_лечения;
			------------------------->''')
			colvobolezney = int(input('Сколько болезней из спика у вас есть? --:'))
			for i in range(colvobolezney):
				# Выбор болезней 
				vvod_bolezni = input('Введите соотбетственную букву вашей болезни --:')
				yourbolezni.append(vvod_bolezni)
				continue

		# Статья 9
		if (9 in choice):
			print('Тут всего пунктов 9.1-9.7')	

			# 9.1
			print('''Пункт: 9.1 \n
			------------------------->
			Хронические воспалительные ревматические, неревматические болезни сердца, кардиомиопатии, дегенеративные и дистрофические поражения сердца:
			а37) с хронической сердечной недостаточностью III стадии
			б37) с хронической сердечной недостаточностью II стадии
			в37) с хронической сердечной недостаточностью I стадии
			г37) без хронической сердечной недостаточности
			------------------------->''')
			colvobolezney = int(input('Сколько болезней из спика у вас есть? --:'))
			for i in range(colvobolezney):
				# Выбор болезней 
				vvod_bolezni = input('Введите соотбетственную букву вашей болезни --:')
				yourbolezni.append(vvod_bolezni)
				continue

			# 9.2
			print('''Пункт: 9.2 \n
			------------------------->
			Артериальная гипертензия:
			а38) III степени
			б38) II степени, риск 4
			в38) II степени, риск 2–3; I степени, риск 3 (с поражением органов-мишеней (далее – ПОМ) – 4
			г38) I степени, риск 1–3 (без ПОМ)
			------------------------->''')
			colvobolezney = int(input('Сколько болезней из спика у вас есть? --:'))
			for i in range(colvobolezney):
				# Выбор болезней 
				vvod_bolezni = input('Введите соотбетственную букву вашей болезни --:')
				yourbolezni.append(vvod_bolezni)
				continue

			# 9.3
			print('''Пункт: 9.3 \n
			------------------------->
			Ишемическая болезнь сердца:
			а39) со значительным нарушением функций
			б39) с умеренным нарушением функций
			в39) с незначительным нарушением функций
			------------------------->''')
			colvobolezney = int(input('Сколько болезней из спика у вас есть? --:'))
			for i in range(colvobolezney):
				# Выбор болезней 
				vvod_bolezni = input('Введите соотбетственную букву вашей болезни --:')
				yourbolezni.append(vvod_bolezni)
				continue

			# 9.4
			print('''Пункт: 9.4 \n
			------------------------->
			Болезни и последствия повреждения аорты, магистральных и периферических артерий и вен, лимфатических сосудов:
			а40) со значительным нарушением кровообращения и функций
			б40) с умеренным нарушением кровообращения и функций
			в40) с незначительным нарушением кровообращения и функций
			г40) при наличии объективных данных без нарушения кровообращения и функций
			------------------------->''')
			colvobolezney = int(input('Сколько болезней из спика у вас есть? --:'))
			for i in range(colvobolezney):
				# Выбор болезней 
				vvod_bolezni = input('Введите соотбетственную букву вашей болезни --:')
				yourbolezni.append(vvod_bolezni)
				continue

			# 9.5
			print('''Пункт: 9.5 \n
			------------------------->
			Геморрой:
			а41) с частыми обострениями и вторичной анемией
			б41) с выпадением узлов II–III стадии
			в41) с редкими обострениями при успешном лечении
			------------------------->''')
			colvobolezney = int(input('Сколько болезней из спика у вас есть? --:'))
			for i in range(colvobolezney):
				# Выбор болезней 
				vvod_bolezni = input('Введите соотбетственную букву вашей болезни --:')
				yourbolezni.append(vvod_bolezni)
				continue

			# 9.6
			print('''Пункт: 9.6 \n
			------------------------->
			Нейроциркуляторная астения:
			а42) при стойких значительно выраженных вегетативнососудистых расстройствах и стойком нарушении ритма и (или) проводимости
			б42) при стойких умеренно выраженных вегетативно сосудистых расстройствах, преходящем нарушении ритма и (или) проводимости
			------------------------->''')
			colvobolezney = int(input('Сколько болезней из спика у вас есть? --:'))
			for i in range(colvobolezney):
				# Выбор болезней 
				vvod_bolezni = input('Введите соотбетственную букву вашей болезни --:')
				yourbolezni.append(vvod_bolezni)
				continue

			# 9.7
			print('''Пункт: 9.7 \n
			------------------------->
			Временные_функциональные_расстройства_системы_кровообращения_после_перенесенного_острого_заболевания,
			обострения_хронического_заболевания,
			травмы_или_перативного_лечения
			------------------------->''')
			colvobolezney = int(input('Сколько болезней из спика у вас есть? --:'))
			for i in range(colvobolezney):
				# Выбор болезней 
				vvod_bolezni = input('Введите соотбетственную букву вашей болезни --:')
				yourbolezni.append(vvod_bolezni)
				continue


		# -------------- пока в доработке
		# Статья 10
		if (10 in choice):
			print('Тут всего пунктов 10.1-10.5')	

		# 10.1
			print('''Пункт: 10.1 \n
			------------------------->
			Болезни полости носа, околоносовых пазух, глотки, аллергические риниты:
			------------------------->''')
			colvobolezney = int(input('Сколько болезней из спика у вас есть? --:'))
			for i in range(colvobolezney):
				# Выбор болезней 
				vvod_bolezni = input('Введите соотбетственную букву вашей болезни --:')
				yourbolezni.append(vvod_bolezni)
				continue

		#Статья 11
		if (11 in choice):
			print('Тут всего пунктов 11.1-11.8')	
		# Статья 12
		if (12 in choice):
			print('Тут всего пунктов 12.1-12.2')		
		# Статья 13
		if (13 in choice):
			print('Тут всего пунктов 13.1-13-7')	
		# Статья 14
		if (14 in choice):
			print('Тут всего пунктов 14.1-14.8')	
		# Статья 15
		if (15 in choice):
			print('Тут всего пунктов 15.1')	
		# Статья 16
		if (16 in choice):
			print('Тут всего пунктов 16.1')	
		# Статья 17
		if (17 in choice):
			print('Тут всего пунктов 17.1-17.6')	
		# Статья 18
		if (18 in choice):
			print('Тут всего пунктов 18.1-18.3')	
		else:
			pass
	
	# годен или нет
	zluzba_or_not(graf)


# /////////////////////////////////////////////////////////////////////////////////////////////////////// 

# определение графы 
def graf_1_2_3():
	
	print('графа I – граждане при приписке к призывным участкам и призыве на срочную военную службу, службу в резерве; \nграфа II – военнослужащие, проходящие срочную военную службу, службу в резерве;')	
	print('графа III – военнослужащие, проходящие военную службу по контракту, офицеры, проходящие военную службу по призыву.\n')
	# графа 1
	if (age < 18):
		print('Вы соответствуете: графе I ')
		graf = 'графа 1'
		infection_and_pain(graf)
	if (age >= 18 & age <= 27):
		sluzba = input('Введите вы служите в армии или пока нет? \nДа / Нет --:')
		# графа 2
		if (sluzba == 'Нет'):
			print('\nВы соответствуете: графе II ')
			graf = 'графа 2'
			infection_and_pain(graf)
		# графа 3
		if (sluzba == 'Да'):
			print('\nВы соответствуете: графе III ')
			graf = 'графа 3'
			infection_and_pain(graf)
		else:
			graf_1_2_3()

	else:
		pass

# Список всех болезней если понадобится 

vse_bolezni = ['Кишечные_инфекции', 'бактериальные_зоонозы', 'бактериальные_болезни', 'вирусные_болезни', 'инфекций_центральной_нервной_системы', 'хламидии', 'риккетсиозы', 'паразитарные болезни',
'а1' , 'б1', 'в1', 'г1', 'д1', 'а2' , 'б2', 'в2', 'г2', 'д2', 'Лепра', 'а3' , 'б3', 'а4' , 'б4', 'в4', 'а5' , 'б5', 'а6' , 'б6', 'а7' , 'б7', 'в7', 'а8' , 'б8', 'в8', 'г8', 'д8',   
'а9' , 'б9', 'в9', 'г9', 'а10' , 'б10', 'в10' , 'а11' , 'б11', 'в11', 'г11', 'д11', 'а12' , 'б12', 'в12', 'г12', 'а13' , 'б13', 'в13',
'а14' , 'б14', 'в14', 'а15' , 'б15', 'а16' , 'б16', 'в16', 'г16', 'а17' , 'б17', 'в17', 'а18' , 'б18', 'а1' , 'б19', 'в19', 'а20' , 'б20', 'в20', 'г20',
'а21' , 'б21', 'в21', 'г21', 'а22' , 'б22', 'в22', 'г22', 'а23' , 'б23', 'в23', 'г23', 'а25' , 'б25', 'в25', 'г25',
'а26' , 'б26', 'в26', 'г26', 'Временные_функциональные_расстройства_центральной_или_периферической_нервной_системы_после_острого_заболевания,_обострения_хронического_заболевания,_травмы_или_оперативного_лечения',
'а27' , 'б27', 'в27', 'а28' , 'б28', 'в28', 'а29' , 'б29', 'в29', 'а30' , 'б30', 'в30',
'а31', 'б31', 'а32' , 'б32', 'в32', 'г32', 'а33' , 'б33', 'в33', 'г33', 'Временные_функциональные_расстройства_органа_зрения_после_острого_заболевания', 'обострения_хронического_заболевания', 'травмы_или_хирургического_лечения'
'экзема_наружного_слухового_прохода_и_ушной_раковины', 'хронический_диффузный_наружный_отит_любой_этиологии', 'приобретенные_сужения_наружного_слухового_прохода',
'а34' , 'б34', 'а35' , 'б35', 'в35', 'а35' , 'б35', 'в35', 'г35', 'а36' , 'б36', 'в36', 'г36', 'обострения_хронического_заболевания', 'травмы_уха_и_сосцевидного_отростка_или_оперативного_лечения',
'а37' , 'б37', 'в37', 'г37', 'а38' , 'б38', 'в38', 'г38', 'а39' , 'б39', 'в39', 'а40' , 'б40', 'в40', 'г40', 'а41' , 'б41', 'в41', 'а42' , 'б42', 
'Временные_функциональные_расстройства_системы_кровообращения_после_перенесенного_острого_заболевания','обострения_хронического_заболевания', 'травмы_или_перативного_лечения'] # -- остальное в доработке    

# Г ГО ВН НГМ ГНС НГИ 

# Годен или нет / относительно граф
def zluzba_or_not(graf):
	# по графе 1
	if (graf == 'графа 1'):

		if ('Кишечные_инфекции', 'бактериальные_зоонозы', 'бактериальные_болезни', 'вирусные_болезни', 'инфекций_центральной_нервной_системы', 'хламидии', 'риккетсиозы', 'паразитарные болезни' in yourbolezni):
			if (trud_legk_bolezni == '+'):
				yourbolezni.append('НГМ')
			else:
				pass
			if (trud_legk_bolezni == '-'):
				yourbolezni.append('ВН')
			else:
				pass
		else:
			pass

		# НГ
		if ('д1', 'д2' in yourbolezni):
			print(familia, name, otchestvo, 'Ваш статус НГ',end = '')
			sys.exit(0)
		else:
			# НГИ
			if ('а1','а2', 'Лепра', 'а3', 'а4', 'а6', 'б6', 'а7', 'б7', 'в7', 'а8', 'а9', 'б9', 'а10', 
				'а11', 'а12', 'а13', 'а14', 'а15', 'а16', 'а17', 'а18', 'а19', 'а20', 'а21', 'а22',
				'а23', 'а25','а26', 'а27', 'а28', 'а29', 'а30', 'а32', 'а33', 'а35', 'а36', 'а37', 'б37',  
				'а38', 'а39', 'а40', 'а41' in yourbolezni):
				print(familia, name, otchestvo, 'Ваш статус НГИ',end = '')
				sys.exit(0)
			else:
				# НГМ
				if ('НГМ', 'б1', 'в1', 'б2', 'в2', 'б3', 'б4', 'а5',  'б8', 'в8', 'в9', 'б10', 'в11', 
					'б12', 'б13','в13', 'б14', 'б15', 'б16', 'б17', 'б18', 'б19', 'б20', 'в20', 'б21', 'в21',
					'б22', 'в22', 'б23', 'в25', 'б26',  'в26', 'б27', 'б28', 'б29',  'в29',  'б30', 'в30', 
			 		'а31', 'б32', 'в32', 'б32', 'в32', 'а34', 'б35', 'б36', 'в36', 'в37',  'б38', 'в38', 
			 		'б39', 'в39',  'б40', 'в40', 'б41', 'а42'   in yourbolezni):
					print(familia, name, otchestvo, 'Ваш статус НГМ',end = '')
					sys.exit(0)
		
				else:
					# ВН
					if ('ВН', 'в4', 'д8',  'г9', 'г11', 'в12', 'в14', 'в16',  'в17', 'Временные_функциональные_расстройства_центральной_или_периферической_нервной_системы_после_острого_заболевания,_обострения_хронического_заболевания,_травмы_или_оперативного_лечения',
						'Временные_функциональные_расстройства_органа_зрения_после_острого_заболевания', 'обострения_хронического_заболевания', 'травмы_или_хирургического_лечения', 
						'экзема_наружного_слухового_прохода_и_ушной_раковины','хронический_диффузный_наружный_отит_любой_этиологии', 'приобретенные_сужения_наружного_слухового_прохода',
						'обострения_хронического_заболевания', 'травмы_уха_и_сосцевидного_отростка_или_оперативного_лечения', 
						'Временные_функциональные_расстройства_системы_кровообращения_после_перенесенного_острого_заболевания',
						'обострения_хронического_заболевания','травмы_или_перативного_лечения' in yourbolezni):
						print(familia, name, otchestvo, 'Ваш статус ВН',end = '')
						sys.exit(0)
					else:
						# ГО
						if ('г1', 'г2', 'д11', 'г12', 'в16', 'г20','г21', 'г22', 'г23', 'г25', 'г26', 
			 				'в27', 'в28', 'б31', 'г32', 'г33',  'б33', 'в35', 'г36', 'г37',  'г38', 'г40', 'в41', 
			 				'б42'  in yourbolezni):
							print(familia, name, otchestvo, 'Ваш статус ГО',end = '')
							sys.exit(0)
						else:
							# Г
							if ('г8', 'в10', 'в11' in yourbolezni):
								print(familia, name, otchestvo, 'Ваш статус Г',end = '')
								sys.exit(0)
							else:
								pass

	else:
		pass


	# по графе 2
	if (graf == 'графа 2'):
	
		if ('Кишечные_инфекции', 'бактериальные_зоонозы', 'бактериальные_болезни', 'вирусные_болезни', 'инфекций_центральной_нервной_системы', 'хламидии', 'риккетсиозы', 'паразитарные болезни' in yourbolezni):
			if (trud_legk_bolezni == '+'):
				yourbolezni.append('НГМ')
			else:
				pass
			if (trud_legk_bolezni == '-'):
				yourbolezni.append('ВН')
			else:
				pass
		else:
			pass

		# НГ
		if ('д1', 'д2' in yourbolezni):
			print(familia, name, otchestvo, 'Ваш статус НГ',end = '')
			sys.exit(0)
		else:
			# НГИ
			if ('а1','а2', 'Лепра', 'а3', 'а4', 'а6', 'б6', 'а7', 'б7', 'в7', 'а8', 'а9', 'б9', 'а10', 
				'а11', 'а12', 'а13', 'а14', 'а15', 'а16', 'а17', 'а18', 'а19', 'а20', 'а21', 'а22',
				'а23', 'а25','а26', 'а27', 'а28', 'а29', 'а30', 'а32', 'а33', 'а35', 'а36', 'а37', 'б37',  
				'а38', 'а39', 'а40', 'а41' in yourbolezni):
				print(familia, name, otchestvo, 'Ваш статус НГИ',end = '')
				sys.exit(0)
			else:
				# НГМ
				if ('НГМ', 'б1', 'в1', 'б2', 'в2', 'б3', 'б4', 'а5',  'б8', 'в8', 'в9', 'б10', 'в11', 
					'б12', 'б13','в13', 'б14', 'б15', 'б16', 'б17', 'б18', 'б19', 'б20', 'в20', 'б21', 'в21',
					'б22', 'в22', 'б23', 'в25', 'б26',  'в26', 'б27', 'б28', 'б29',  'в29',  'б30', 'в30', 
			 		'а31', 'б32', 'в32', 'б32', 'в32', 'а34', 'б35', 'б36', 'в36', 'в37',  'б38', 'в38', 
			 		'б39', 'в39',  'б40', 'в40', 'б41', 'а42'   in yourbolezni):
					print(familia, name, otchestvo, 'Ваш статус НГМ',end = '')
					sys.exit(0)
		
				else:
					# ВН
					if ('ВН', 'в4', 'д8',  'г9', 'г11', 'в12', 'в14', 'в16',  'в17', 'Временные_функциональные_расстройства_центральной_или_периферической_нервной_системы_после_острого_заболевания,_обострения_хронического_заболевания,_травмы_или_оперативного_лечения',
						'Временные_функциональные_расстройства_органа_зрения_после_острого_заболевания', 'обострения_хронического_заболевания', 'травмы_или_хирургического_лечения', 
						'экзема_наружного_слухового_прохода_и_ушной_раковины','хронический_диффузный_наружный_отит_любой_этиологии', 'приобретенные_сужения_наружного_слухового_прохода',
						'обострения_хронического_заболевания', 'травмы_уха_и_сосцевидного_отростка_или_оперативного_лечения', 
						'Временные_функциональные_расстройства_системы_кровообращения_после_перенесенного_острого_заболевания',
						'обострения_хронического_заболевания','травмы_или_перативного_лечения' in yourbolezni):
						print(familia, name, otchestvo, 'Ваш статус ВН',end = '')
						sys.exit(0)
					else:
						# ГО
						if ('г1', 'г2', 'д11', 'г12', 'в16', 'г20','г21', 'г22', 'г23', 'г25', 'г26', 
			 				'в27', 'в28', 'б31', 'г32', 'г33',  'б33', 'в35', 'г36', 'г37',  'г38', 'г40', 'в41', 
			 				'б42'  in yourbolezni):
							print(familia, name, otchestvo, 'Ваш статус ГО',end = '')
							sys.exit(0)
						else:
							# Г
							if ('г8', 'в10', 'в11' in yourbolezni):
								print(familia, name, otchestvo, 'Ваш статус Г',end = '')
								sys.exit(0)
							else:
								pass

	else:
		pass
	

	# по графе 3
	if (graf == 'графа 3'):
		
		if ('Кишечные_инфекции', 'бактериальные_зоонозы', 'бактериальные_болезни', 'вирусные_болезни', 'инфекций_центральной_нервной_системы', 'хламидии', 'риккетсиозы', 'паразитарные болезни' in yourbolezni):
			if (trud_legk_bolezni == '+'):
				yourbolezni.append('НГМ,ГНС-ИНД')
			else:
				pass
			if (trud_legk_bolezni == '-'):
				yourbolezni.append('ВН')
			else:
				pass
		else:
			pass

		# НГ
		if ('умер' in yourbolezni):
			print(familia, name, otchestvo, 'Ваш статус НГ',end = '')
			sys.exit(0)

		# НГИ
		if ('а2','Лепра', 'а3', 'а4', 'а6',  'б6', 'а7', 'б7', 'а9', 'в9', 'а10', 'а11',
		'а12', 'а13', 'а14', 'а15', 'а16', 'а17','а18', 'а19', 'а20', 'а21', 'а22', 
		'в22', 'а23', 'а25', 'а26', 'а27',  'а28',  'а29', 'а30', 'а32', 'а33', 'а35', 'а36', 'а37', 
		'а38', 'а40', 'а41' in yourbolezni):
			print(familia, name, otchestvo,'Ваш статус НГИ',end = '')
			sys.exit(0)

		# НГМ
		if ('НГМ,ГНС-ИНД','б2','б3', 'б4', 'а5', 'а8', 'б8', 'б9','в11', 'б12',
		'б13',  'в13',  'б14', 'б15', 'б16', 'б17', 'в18', 'б19', 'б20', 'в20', 'б21', 'в21', 'б22',
		 'б23', 'в23', 'в25', 'б26', 'в26', 'б27', 'б28', 'б29', 'в29', 'б30', 'в30',
		 'а31', 'б32', 'в32', 'б32', 'в32', 'а34', 'б35', 'б36', 'в36', 'б37', 'в37', 'б38', 'в38', 
		 'б39', 'в39', 'б40', 'в40', 'б41', 'а42'  in yourbolezni):
			print(familia, name, otchestvo,'Ваш статус НГМ',end = '')
			sys.exit(0)
		
		'''
		# ГНС
		if (' ' in yourbolezni):
			print('ГНС')
		'''

		# ВН
		if ( 'д2','в4', 'в7', 'д8', 'г9','г11', 'в12', 'в16'  'Временные_функциональные_расстройства_центральной_или_периферической_нервной_системы_после_острого_заболевания,_обострения_хронического_заболевания,_травмы_или_оперативного_лечения' 
			'Временные_функциональные_расстройства_органа_зрения_после_острого_заболевания', 'обострения_хронического_заболевания', 'травмы_или_хирургического_лечения', 
			'обострения_хронического_заболевания', 'травмы_уха_и_сосцевидного_отростка_или_оперативного_лечения',
			'Временные_функциональные_расстройства_системы_кровообращения_после_перенесенного_острого_заболевания',
			'обострения_хронического_заболевания','травмы_или_перативного_лечения' in yourbolezni):
			print(familia, name, otchestvo, 'Ваш статус ВН',end = '')
			sys.exit(0)
			

		# ГО
		if ('в2', 'в8', 'б10', 'д11', 'в14', 'в17', 'г20', 'г21', 'г22', 'в23', 'г23', 'г25',
			'г26', 'в28', 'б31', 'г32', 'экзема_наружного_слухового_прохода_и_ушной_раковины',
			'хронический_диффузный_наружный_отит_любой_этиологии', 
			'приобретенные_сужения_наружного_слухового_прохода',
			 'б33', 'б42' in yourbolezni):  
			print(familia, name, otchestvo, 'Ваш статус ГО',end = '')
			sys.exit(0)
		# Г
		if ('г2', 'г8', 'в10', 'в11', 'г12', 'в16', 'в27', 'г33', 'в35', 'г36', 'г37', 'г38', 'г40',  'в41' in yourbolezni):
			print(familia, name, otchestvo, 'Ваш статус Г',end = '')
			sys.exit(0)
	else:
		pass

		
datarequest()
