
#$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$

# Задание 3
def smen_znach(x):
	# Смена местами, (// - целочисленное деление )
	return (x % 10 * 10) + x//10

def my_funk(N, M):
	# Первое произведение 
	num_proisv = N * M
	# Переворачиваем
	swap_num_proiz = smen_znach(N) * smen_znach(M) 
	# Проверка
	if (num_proisv == swap_num_proiz):
		# - \ использовал для того чтобы продолжить со след. строки т.к на листике не было места
		# Переворачиваем обратно для истинного значения, т.к это первое 
		print('Значения', str(smen_znach(N)),'*', \
		str(smen_znach(M)),'совпадают =', \
		str(swap_num_proiz))
	else:
		# Значит они не совпадают
		pass

# Для проверки каждого числа с каждымчислом 
for i in range(10,100,1):
	for j in range(10,100,1):
		my_funk(i, j)



#$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$

# ????
print('Next')
# ????

#$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$

# Задание 4

# input
my_str = input('Введите ваше предложение: ')
# Список символов для примера
# Опять же - \ использую т.к на листе не поместилась 
simbol_list = ['!','@','$', '#','%','^','&',\
'*','(',')','-','+', ',' ,'.', '?']

# i - берет по одному элементу списка
for i in simbol_list:
	# Проверяет на наличие символа в строке
	if i in my_str:
		# Убираем ненужные c заменой на пробел
		my_str = my_str.replace(i, ' ')

# Разделение по пробелам на список
list_ = my_str.split()
# Сколько слов
size_list = len(list_)

# Проверка на слово / если состоит из меньше чем 3 буквы это уже не слово
for i in list_:
	if len(i) < 3:
		size_list -= 1
	else:
		pass

# print
print('В вашем предложении', str(size_list), \
'слова\n')

# print слова у которых len() букв четная
print('Слова с четным знач. букв:')
for i in list_:
	if len(i) % 2 == 0 and len(i) >= 3:
		print(i)

#$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$






