#-------------------------------------------------------------------------
#8. ЦИКЛЫ С УСЛОВИЕМ
#-------------------------------------------------------------------------
# Вариант 6
# Задание 8 / while
#-------------------------------------------------------------------------
from math import*
# По условию
x_0 = 0.1
x_n = 2
delta_x = 0.2 
a = 2.2
i = 0.1
x = 0

# 100
while (x_0 <= x_n):
	x=x_0 +i*delta_x
	# Ветка №1	
	if (x < 0.5):
		z = (pow(log(x), 3) + pow(x,2)) / sqrt(x+a)
		print('# Ветка №1 ====> ' + str(z))
	else:
		# Ветка №2
		if (x == 0.5):
			z = sqrt(x+a) + 1/x
			print('# Ветка №2 ====> ' + str(z))
		else:
			# Ветка №3
			if (x > 0.5):
				z = cos(x) + a*pow(sin(x), 2)
				print('# Ветка №3 ====> ' + str(z))
			else:
				pass
	# Увеличение i
	i += 0.1
	# Увеличение 
	x_0 += 0.1
#-------------------------------------------------------------------------