#-------------------------------------------------------------------------
#6. ЛОГИЧЕСКОЕ ВЫРАЖЕНИЕ В УСЛОВНОМ ОПЕРАТОРЕ
#-------------------------------------------------------------------------
# Вариант 6
# Задание 6
#-------------------------------------------------------------------------

# ответы на вопросы 
''' 
2. (Слон) Одним ходом можно попасть, если на его линии не будет пешки. В два хода - убрать пешку с линии и сделать ход, еще как смотреть какой слон левый или правый. Повлияет на расположение (m,n)
3. (Конь) Одним ходом не получиться, только в два хода, конь может оказаться в двух точках (не одновременно конечно), еще как смотреть какой конь левый или правый. Повлияет на расположение (m,n)
4. (Ферзь) Одним ходом можно, если не будет пешки. В два хода - убрать пешку с линии и сделать ход.
'''

'''
# пока делал задание, все назывния тип слон, ферзь знал - а батя сказал что еще ладья это тура
5. На поле (k, l) стоит ладья, на поле (m, n) – слон.
- будет бить если слон или будет стоять напрямую к ладье / Если совпадают значение по горизонту сверху и снизу, а слон будет смотреть в свою очередь по диагонали относительно его цвета 
6. На поле (k, l) стоит ладья, на поле (m, n) – конь.
- Если совпадают значение по горизонту сверху и снизу, а конь будет подподать если станет напрямую
7. На поле (k, l) стоит ладья, на поле (m, n) – ферзь.
- Если совпадают значение по горизонту сверху и снизу, у ферзя больше преимушества она смотрит еще и по диагоналям 
8. На поле (k, l) стоит ферзь, на поле (m, n) – пешка.
- ферзь смотрит прямо, назад и по диагонали - пешка может побить только в упоре и то на одну клетку 
9. На поле (k, l) стоит ферзь, на поле (m, n) – конь.
- ферзь смотрит прямо, назад и по диагонали - конь чекает буквой Г в две точки от него 
10. На поле (k, l) стоит ферзь, на поле (m, n) – слон.
- слон угрожаеть опять же только по диагонали, ферзь может побить по прямой
11. На поле (k, l) стоит слон, на поле (m, n) – конь.
- слон контралирует по диагонали от него, если конь стоит на них то побъет - конь опять же смотри буквой Г 
12. На поле (k, l) стоит слон, на поле (m, n) – пешка.
- слон сможет побить если пешка находится на диагонали, пешка ток в упоре
13. На поле (k, l) стоит слон, на поле (m, n) – король.
- слон чекает по диагонали но в упоре короля побъет
'''
#-------------------------------------------------------------------------