#-------------------------------------------------------------------------
#15. ВЛОЖЕННЫЕ ЦИКЛЫ С ПЕРЕМЕННЫМИ ГРАНИЦАМИ
#-------------------------------------------------------------------------
# Вариант 6
# Задание 15
#-------------------------------------------------------------------------

# для теста матрица
array = [ [9,9,9,9,9,9],
		  [1,9,9,9,9,1],
		  [1,1,9,9,1,1], 
		  [1,1,1,1,1,1],   
		  [1,1,1,1,1,1] ]

# list 
list_1 = []
list_2 = []
list_3 = []

# help
ind_EX = 0
nummmm = 0


for i in range(0, len(array)+1, 1):
	# Добавление в list диагонали
	list_1.append(array[0][ind_EX+nummmm])
	list_2.append(array[1][ind_EX+nummmm])
	list_3.append(array[2][ind_EX+nummmm])	

	# Увеличиваем для ind_EX
	nummmm+=1

# Вывод для проверки элементов в треугольнике
print(list_1)

del list_2[0]
del list_2[-1]
print('  ',list_2)

del list_3[0]
del list_3[0]
del list_3[-1]
del list_3[-1]
print('     ',list_3)

index = 0
sum_all = 0
# Сумма треугольника
sum_treug = list_1 + list_2 + list_3
for i in sum_treug:
	sum_all += sum_treug[index]

print('Сумма треугольника = ',sum_all)
#-------------------------------------------------------------------------