#-------------------------------------------------------------------------
#2.ЦЕЛОЧИСЛЕННАЯ АРИФМЕТИКА. ПРИВЕДЕНИЕ ТИПОВ
#-------------------------------------------------------------------------
# Вариант 6
# Задание 2.2
#-------------------------------------------------------------------------
while True:
	try:
		n = float(input('Введите вещественное число: '))
		break
	except TypeError:
		print('Error')
		continue

# если отрицательное
if (n < 0):
	n = -n;
else:
	pass

# обнуляю целую часть 
n_int_1 = int(n)
drob_chast = n - n_int_1

# Двигаю 4 числа в целую часть и обрезаю дробную 
my_gotov_number = drob_chast * 10000
my_gotov_number = int(my_gotov_number)

# Разделение цифр
num_1 = my_gotov_number / 1000
num_1 = int(num_1)

num_2 = (my_gotov_number / 100) % 10
num_2 = int(num_2)

num_3 = (my_gotov_number / 10) % 10
num_3 = int(num_3)

num_4 = my_gotov_number % 10
num_4 = int(num_4)

# Соединение
otvet = num_1 + num_2 + num_3 + num_4

print('Сумма первых четырех цифр дробной части: ' + str(otvet))
#-------------------------------------------------------------------------