#-------------------------------------------------------------------------
#5.ВЕТВЛЕНИЯ
#-------------------------------------------------------------------------
# Вариант 6
# Задание 5  1_Способ
#-------------------------------------------------------------------------
from math import*
#
while True:
	try:
		x = float(input('Введите x: '))
		break
	except TypeError:
		print('Error')
		continue
# Просто if
if (x >=0 and x <= pi/2):
	y = sin(x)
	print('Ваше значение y = '+str(y))
else:
	print('x не соответствует 0 >= x and x <= pi/2')	
#-------------------------------------------------------------------------