#-------------------------------------------------------------------------
#15.2 СИМВОЛЬНЫЕ МАТРИЦЫ
#-------------------------------------------------------------------------
# Вариант 6
# Задание 15.2
#-------------------------------------------------------------------------

# Не сделал до конца
'''
Определить номер последнего по порядку столбца, содержащего
наименьшее число цифр.
По идее массив имеет один тип данных, но листы позволяют многое, значит нужна чекать цифры
'''
list_ = [0,1,2,3,4,5,6,7,8,9]

# для теста
array = [ [9,9,9,9,'#',9],
		  [1,9,9,9,9,1],
		  [1,1,9,9,1,1], 
		  [1,1,1,1,1,1],   
		  [1,1,1,1,1,1] ]


# Для проверки
for i in array:
    print(i)


# смена строк на столбцы
_rows_ = len(array)
_cols_ = len(array[0])
#
n_array = [[0]*_rows_ for _ in range(_cols_)]
#
for i in range(_rows_):
    for j in range(_cols_):
        n_array[j][i] = array[i][j]

print('\n')
# Для проверки
for i in n_array:
    print(i)

#
innndex = 0
index = 0
for i in range(len(n_array)):
	if (innndex == len(n_array)):
		innndex = 0
	else:
		for j in range(len(n_array[innndex])):
			if (j == list_[index]):
				continue
			else:
				#######
			index +=1
		innndex+=1

print('\n')
# Для проверки
for i in n_array:
    print(i)

#
#-------------------------------------------------------------------------