#-------------------------------------------------------------------------
#1.ВЫЧИСЛЕНИЯ ПО ФОРМУЛАМ. ИСПОЛЬЗОВАНИЕ СТАНДАРТНЫХ МАТЕМАТИЧЕСКИХ ФУНКЦИЙ
#-------------------------------------------------------------------------
# Вариант 6
# Задание 1
#-------------------------------------------------------------------------

# x - не может быть 0 тут sqrt(1/x)
# x - не может быть (-1) тут pow(ln(1+x), 2) 
# Для проверки что работает - 1
from math import* 

def funk():
	x = 0
	y = 0
	
	# Выбор типа
	your_vibor = input('Тип числа\n1.Целочисленный\n2.Вещественное с фиксированной точкой\nи с плавающей точкой.\nВаше значение: ')
	x = input('Ввод x: ') # для инициализации данного в тексте программы 
	
	while True:
		# 1
		if (your_vibor == '1'):
			try:
				x = int(x)
				break
			except:
				print('Error')
		else:
			# 2
			if (your_vibor == '2'):
				try:
					x = float(x)
					break
				except:
					print('Error')
			# Если не 1 и не 2
			else:
				print('другого нет...')
				continue

	# Для проверки	
	while True:
		try:
			y = (pow((cos(pow(e,x)) + pow(e, pow(x, 2)) + sqrt(1/x)), 1/4) / (pow(pi*cos(pow(x, 3))  + pow(log(1+x), 2), sin(x))))
			y = str(y) # инициализация в тексте пр.
			print(y) 
			break
		except:
			print('Ошибка, данное значение x не подходит')
			continue

funk()
#-------------------------------------------------------------------------