#-------------------------------------------------------------------------
#4.ОБЛАСТИ НА ПЛОСКОСТИ
#-------------------------------------------------------------------------
# Вариант 6
# Задание 4
#-------------------------------------------------------------------------
from math import*
#
while True:
	try:
		x = float(input('x: '))
		y = float(input('y: '))
		break
	except:
		print('Error')
		continue

# Уравнение окружности x^2 + y^2 = R^2, (sqrt(x^2 + x^2))
R = sqrt((pow(x, 2) + pow(y, 2)))

# Формула стороны квадрата через радиус вписанной окружности
# a = D/sqrt(2)
# a/2 - сторона маленького квадрата и часть радиуса

# диагональ равна 1
d = 1
a = d/sqrt(2)/2

# Проверка
if (R >= a and R <= 1):
	print('Принадлежит')
else:
	print('Не Принадлежит')
#-------------------------------------------------------------------------