#-------------------------------------------------------------------------
#2.ЦЕЛОЧИСЛЕННАЯ АРИФМЕТИКА. ПРИВЕДЕНИЕ ТИПОВ
#-------------------------------------------------------------------------
# Вариант 6
# Задание 2.1
#-------------------------------------------------------------------------
n = 0
while True:	
	try:
		n = int(input('Введите четырехзначное натуральное n -- '))						
	except TypeError:
		print('Ошибка')

	if (n >= 999 and n <= 9999):
		break
	else:
		pass

# Узнаем цифру в каждом разряде 
a = n / 1000 
b = (n / 100) % 10
c = (n / 10) % 10
d = n % 10

# Проверка

# (a,b,c) == 5, d !=5
if((int(a) == 5 and int(b) == 5 and int(c) == 5 and int(d) != 5)):
	print(True)
else:
	# (a,b,d) == 5, c !=5
	if((int(a) == 5 and int(b) == 5 and int(c) != 5 and int(d) == 5)):
		print(True)
	else:
		# (a,c,d) == 5, b !=5	
		if((int(a) == 5 and int(b) != 5 and int(c) == 5 and int(d) == 5)):
			print(True)
		else:
			# (b,c,d) == 5, a !=5	
			if((int(a) != 5 and int(b) == 5 and int(c) == 5 and int(d) == 5)):
				print(True)
			# Если не 3 пятерки
			else:
				print(False)
#-------------------------------------------------------------------------
