#-------------------------------------------------------------------------
#18. ВЫДЕЛЕНИЕ СЛОВ В СТРОКЕ
#-------------------------------------------------------------------------
# Вариант 6
# Задание 18
#-------------------------------------------------------------------------
# Для теста строка - Hi, my name Matvey! .,:;!?-()	
# «пробел», «.», «,», «:», «;», «!», «?», «-», «(», «)».
# Слово – непустая последовательность любых символов, кроме символов-разделителей.
def my_funk(stroka):
	stroka = list(stroka)
	# Символы разделители 
	list_ = ['.', ',', ':', ';', '!', '?','-', '(', ')']
	#
	index = 0
	# Проверка каждого символа по очередно 
	for j in range(len(stroka)):
		# По одному символу
		for i in stroka:
			####
			if (index == len(list_)):
				# Обнуляем, а то будет ошибка если перейдет границу при след. элементе 
				index = 0 # - Очень важная строчка
			####
			else:
				# Если символ есть в списке - /удаление
				if (i == list_[index]):
					stroka.remove(i)
				else:
					continue		
		# До длинны list_, с символами
		if (index <= len(list_)):
			index+=1
		else:
			continue
	# Соединяем
	stroka_2 = ''.join(stroka)
	return stroka_2

stroka = input('Введите строку: ')
print(my_funk(stroka))
#-------------------------------------------------------------------------