#-------------------------------------------------------------------------
#11. Простые числа
#-------------------------------------------------------------------------
# Вариант 6
# Задание 11
#-------------------------------------------------------------------------
i = 0
f = 0
while True:
	# Простое число делится только на само себя и 1
	if (i % 2 !=0 and i % 3 != 0 and i % 4 != 0):
		print(i)
		f+=1
	else:
		# До 100 простых чисел
		if (f == 100):
			break
		else: 
			pass
	# Нарастим число
	i += 1
#-------------------------------------------------------------------------