#-------------------------------------------------------------------------
#14. ПРОСТИЙШИЕ ДЕЙСТВИЯ НАД ЭЛЕМЕНТАМИ МАТРИЦ
#-------------------------------------------------------------------------
# Вариант 6
# Задание 14
#-------------------------------------------------------------------------
''' 
//// Можно сделать массив с numpy, и использовать функции  array()  arange()  zeros(), ones() и random()
или я видел еще from array import*
'''
# import random
# Пример Заполнение массива
####################
'''
array_zap = []
INDE_x = 0
for i in range(2):
	for j in range(2):
		NU_M = int(input('array_zap['+str(INDE_x)+']: ')) # random.randrange(start, stop, step)
		array_zap.append(NU_M) 
		INDE_x+=1
print(array_zap)
'''
####################
def my_ffunk(array):
	index = 0
	ind_EX = 0

	# все такие числа k, что k-я строка совпадает с k-м столбцом
	# K1
	num_K1 = array[index][ind_EX]
	# K2 
	num_K2 = array[index][ind_EX+len(array[index])-1]
	# K3
	num_K3 = array[index+len(array[index])-1][ind_EX]
	# K4
	num_K4 = array[index+len(array[index])-1][ind_EX+len(array[index])-1]

	print('k-k:',num_K1, num_K2, num_K3, num_K4, end='')

	index = 0
	ind_EX = 0
	print('\n')
	# Для увеличения ind_EX / столбца
	nummmm = 0

	# list для дальнейшего поиска найбольшего элемента
	list_ = []

	for i in range(0, len(array[index]), 1):
		# Добавление в list диагонали
		list_.append(array[index][ind_EX+nummmm])
		# Увеличиваем для ind_EX
		nummmm+=1
		# увеличение строки
		index+=1


	# наибольший элемент главной диагонали матрицы
	print('Наибольший элемент диагонали', max(list_))

	# вывести на печать строку, в которой находится наибольший элемент диагонали 
	max_elem = max(list_)
	print('Строка в которой находится наибольший элемент диагонали - ',list_.index(max_elem))

####################

# 8 x 8 для теста / Тут на диагонали самая большая цифра - 9
array = [ [7,4,4,4,4,4,4,7],
		  [1,5,5,5,5,5,5,3], 
		  [1,5,6,6,6,6,5,3],
		  [1,5,6,7,7,6,5,3],
		  [1,5,6,7,9,6,5,3], 
		  [1,5,6,6,6,6,5,3], 
		  [1,5,5,5,5,5,1,3],  
		  [7,2,2,2,2,2,2,7] ]


my_ffunk(array)
#-------------------------------------------------------------------------