#-------------------------------------------------------------------------
#10. Перебор значений
#-------------------------------------------------------------------------
# Вариант 6
# Задание 10
#-------------------------------------------------------------------------
from math import*
# Ввод
while True:
	try:
		m = int(input('m: '))
		n = int(input('n: '))
		t = n
		break
	except:
		continue
# 1
while (n > 0):
	# 2s
	while t > 0:
		# проверка на квадрат суммы
		if ((pow(n, 2) + 2*n*t + pow(t, 2)) == m):
			print(str(n) + '\t' + str(t))
		else:
			continue
		# Уменьшаем 
		--t
		# До нуля
		if (t == 0):
			break
		else:
			pass
	# У меньшаем для проверки след числа
	--n 
	# До нуля
	if (n == 0):
		break
	else:
		pass
#-------------------------------------------------------------------------