#-------------------------------------------------------------------------
#7. ПРОСТЫЕ ЦИКЛЫ
#-------------------------------------------------------------------------
# Вариант 6
# Задание 7
#-------------------------------------------------------------------------
sum_0 = 0
_sum_ = 0
number = 0
# Ввод
while True:
	try:
		number = int(input('Введите значение: '))
		break
	except:
		print('Error')
		continue
# % 5
for i in range(1, number+1, 1):
	if (i % 5 == 0):
		sum_0 = _sum_
		_sum_ = sum_0 + i
	else:
		continue
print(_sum_)
#-------------------------------------------------------------------------