#-------------------------------------------------------------------------
#12. ОДНОМЕРНЫЙ МАССИВ
#-------------------------------------------------------------------------
# Вариант 6
# Задание 12
#-------------------------------------------------------------------------

def funk(list_):
	sum_ = 0
	# Индекс максимального значения массива
	max_num_for_index = list_.index(max(list_))
	b = max_num_for_index 
	# Сколько всего элементов в массиве
	max_size_list = len(list_)

	# Цикл от и до маскимального размера - 1, т.к массив начинается с нуля
	while max_num_for_index <= max_size_list-1:
		# Нахождение суммы //// хотел написать max_num_for_index += 1 тут чтобы потом не отнимать max элемент, но так не проходит
		sum_ += list_[max_num_for_index]
		max_num_for_index += 1

	# Минус max элемент т.к он в сумму не входит 
	sum_ -= list_[b]
	# return
	return sum_


# массив для теста 
list_ = [1,2,3,10,1,1,1,1,1,2]

print(funk(list_))
#-------------------------------------------------------------------------